using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CargoLoader.GalacentreAPI
{
    public static class Constants
    {
        public const string SpecMaterial = "Материал=";
        public const string SpecWeight = "Вес в упаковке=";
        public const string SpecDimensions = "Размер упаковки=";
        public const string SpecPower = "Мощность";

        public const string PropsType = "Тип товара=";
        public const string PropsBrand = "Бренд=";

        public static readonly string[] nonPropMaterials = new string[] { "Стекло", "диоксид циркония", "фарфор",
            "мрамор", "керамика", "карбон", "парафин", "акрил", "бамбук", "силикон", "полиэстер", "поролон",
                "хлопок", "картон", "мех", "винил",  "пенополиэтилен", "шерсть"};

        public static readonly string[] PropMaterials = new string[] { "резина", "ПВХ", "Полипропилен", "пластик",
                "металл", "алюминий", "жаропрочный нейлон", "камень", "дерево", "сталь", "береза",
                "бук", "нейлон", "Чугун", "фанера березы", "медь", "кожа", "ПВА", "экокожа", "Оксфорд",
                "ковролин", "микрофибра", "латунь", "Полиуретан", "латекс", "поливинилхлорид", "текстиль",
                "хром", "этиленвинилацетат", "полиэфир", "полиэтилен", "сизаль", "ЭВА", "ПЭТ", "ТПЭ",
                "х/б", "джут", "ПЭ", "бумага","Алюминевый сплав", "PVC", "ХБ", "натуральная щетина",
                "искуственная щетина", "МДФ", "ПЕВА", "спанбонд", "ТЭП"};


        public static readonly string[] fragileMaterials = new string[] { "Стекло", "диоксид циркония", "фарфор", "мрамор",
                "керамика", "карбон", "парафин"};

        public static  readonly string[] nonFragileMaterials = new string[] { "резина", "ПВХ", "Полипропилен", "пластик",
                "акрил", "металл", "алюминий", "жаропрочный нейлон", "камень", "бамбук", "дерево", "сталь",
                "силикон", "береза", "бук", "нейлон", "Чугун", "фанера березы", "полиэстер", "медь", "кожа",
                "поролон", "ПВА", "экокожа", "Оксфорд", "ковролин", "микрофибра", "латунь", "Полиуретан", "латекс",
                "поливинилхлорид", "текстиль", "хлопок", "хром", "этиленвинилацетат", "полиэфир", "шерсть","полиэтилен",
                "картон", "сизаль", "мех", "ЭВА", "ПЭТ", "винил", "ТПЭ", "х/б", "джут", "ПЭ", "пенополиэтилен", "бумага",
                "Алюминевый сплав", "PVC", "ХБ", "натуральная щетина", "искуственная щетина", "МДФ", "ПЕВА", "спанбонд",
                "ТЭП"};
    }
}
